In [2]:
import pandas as pd

In [3]:
Airports = pd.Series(['Seattle-Tacoma', 'Dulles', 'London-Heathrow', 'Schiphol'])

In [4]:
Airports

0     Seattle-Tacoma
1             Dulles
2    London-Heathrow
3           Schiphol
dtype: object

In [9]:
Airports_City = pd.DataFrame([['Seattle-Tacoma', 'Seattle', 'USA', 'Schiphol'],
                            ['Dulles', 'Washington', 'USA'],
                            ['London-Heathrow', 'London', 'United Kingdom'],
                            ['Schiphol', 'Amsterdam', 'Netherlands']])

# DataFrame Notes

1. Notice that pd.DataFrame is a List of lists.

In [10]:
Airports_City

                 0           1               2         3
0   Seattle-Tacoma     Seattle             USA  Schiphol
1           Dulles  Washington             USA      None
2  London-Heathrow      London  United Kingdom      None
3         Schiphol   Amsterdam     Netherlands      None

In [12]:
Airports_City = pd.DataFrame([['Seattle-Tacoma', 'Seattle', 'USA'],
                            ['Dulles', 'Washington', 'USA'],
                            ['London-Heathrow', 'London', 'United Kingdom'],
                            ['Schiphol', 'Amsterdam', 'Netherlands']], columns = ['Name', 'City', 'Country'])

In [13]:
Airports_City

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

# head(). tail(), info(), shape

In [14]:
Airports_City.head(2)

             Name        City Country
0  Seattle-Tacoma     Seattle     USA
1          Dulles  Washington     USA

In [15]:
Airports_City.tail(2)

              Name       City         Country
2  London-Heathrow     London  United Kingdom
3         Schiphol  Amsterdam     Netherlands

In [22]:
Airports_City.shape

(4, 3)

In [20]:
Airports_City.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   City     4 non-null      object
 2   Country  4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

# Query Data frame - iloc ,

In [27]:
Airports_City[['Name', 'City', 'Country']]

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

In [30]:
Airports_City.iloc[1,2]

'USA'

# also specify a range in the iloc

In [33]:
Airports_City.iloc[:,:]

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

In [34]:
Airports_City.iloc[:,0:2]

              Name        City
0   Seattle-Tacoma     Seattle
1           Dulles  Washington
2  London-Heathrow      London
3         Schiphol   Amsterdam